## Preparing and Cleaning Data

In [2]:
import pandas as pd
import numpy as np

In [3]:
y = pd.Series(['AAA', 'BBB', np.nan, 'DDD'])
y.isnull()

y[0] = None
y.notnull()
y.fillna('new Value') # we can replace values with our own alternatives

0    new Value
1          BBB
2    new Value
3          DDD
dtype: object

## filter out missing data

In [4]:
x = y.dropna() # any NaN or None values are removed from the output (does not persist)
x

1    BBB
3    DDD
dtype: object

In [5]:
# we CAN force the changes to persist
y.dropna(inplace=True) # the changes persist in the original structure
y

1    BBB
3    DDD
dtype: object

## Fill in missing values

In [6]:
# simple series to work with
df = pd.DataFrame(np.random.randn(10,3))
# inject some missing values
df.iloc[:4,1] = np.nan
df.iloc[:2,2] = np.nan
df

          0         1         2
0  0.086845       NaN       NaN
1 -0.622869       NaN       NaN
2  1.337677       NaN -1.122171
3  0.685790       NaN -1.104984
4 -0.501641  1.662722  0.792110
5 -0.778673  0.223735 -1.205799
6  0.207638  0.521814  0.097609
7  1.161060 -1.050059 -1.038567
8 -1.716007  0.663114  0.840458
9  0.275532 -0.132647 -0.493808

In [17]:
# various ways to replace NaN missing values
df.fillna(method='ffill', axis=1)
df.fillna({1:0.5, 2:0.8}) # specify values for each column
df.dropna(thresh=2) # remove any row that has an NaN
df.fillna(method='ffill',axis=1, limit=1)
# typically we interpolate from the other values
df.fillna(df.mean()) # fills with the mean of the column, ignoring NaN in the mean calculation

          0         1         2
0  0.086845  0.314780 -0.404394
1 -0.622869  0.314780 -0.404394
2  1.337677  0.314780 -1.122171
3  0.685790  0.314780 -1.104984
4 -0.501641  1.662722  0.792110
5 -0.778673  0.223735 -1.205799
6  0.207638  0.521814  0.097609
7  1.161060 -1.050059 -1.038567
8 -1.716007  0.663114  0.840458
9  0.275532 -0.132647 -0.493808

In [51]:
# use fillna
c1mean = df.iloc[:, 1].mean()
df.fillna(c1mean, inplace=True)
df

          0         1         2
0 -0.229359 -0.775926 -0.775926
1  0.996537 -0.775926 -0.775926
2  0.940707 -0.775926 -0.350989
3 -0.707323 -0.775926 -0.240707
4 -0.050891 -1.438380 -0.978631
5  0.235573 -0.274778  0.001522
6 -0.075725 -0.980495  0.293504
7 -2.125656 -0.636884 -0.200232
8 -1.960446 -0.007234 -2.719418
9  1.015953 -1.317787  1.187072

## Remove Duplicates

In [62]:
df = pd.DataFrame({
    'A': ['I', 'II','I','II','I','II','I','II','III'],
    'B': [1,    2,   3,  4,   1,  2,   3,  4,   3]
})
df.duplicated() # True for any rows which are duplicates of earlier rows
df.drop_duplicates(inplace=True)
df

     A  B
0    I  1
1   II  2
2    I  3
3   II  4
8  III  3

## Replacing Values

In [63]:
df.replace(4,22, inplace=True)
df

     A   B
0    I   1
1   II   2
2    I   3
3   II  22
8  III   3